; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x  - location ?y - location) 
		(path ?x  - location ?y - location)
		(empty ?v - truck)
)
  (:functions 	
		(time-to-drive ?l1 - location ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-4-6-9)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	package9 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	p0-2 - location
	p0-3 - location
	p2-0 - location
	p2-3 - location
	p2-4 - location
	p3-1 - location
	p4-2 - location
	p4-3 - location
	)
	(:init
	(at driver1 s2)
	(at driver2 s3)
	(at driver3 s1)
	(at driver4 s1)
	(at truck1 s3)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s1)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s4)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at truck4 s4)
	(empty truck4)
	(= (load truck4) 0)
	(= (fuel-per-minute truck4) 10)
	(at truck5 s4)
	(empty truck5)
	(= (load truck5) 0)
	(= (fuel-per-minute truck5) 10)
	(at truck6 s2)
	(empty truck6)
	(= (load truck6) 0)
	(= (fuel-per-minute truck6) 10)
	(at package1 s4)
	(at package2 s1)
	(at package3 s4)
	(at package4 s0)
	(at package5 s1)
	(at package6 s2)
	(at package7 s0)
	(at package8 s1)
	(at package9 s0)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(path s0 p0-3)
	(path p0-3 s0)
	(path s3 p0-3)
	(path p0-3 s3)
	(path s2 p2-3)
	(path p2-3 s2)
	(path s3 p2-3)
	(path p2-3 s3)
	(path s2 p2-4)
	(path p2-4 s2)
	(path s4 p2-4)
	(path p2-4 s4)
	(path s3 p3-1)
	(path p3-1 s3)
	(path s1 p3-1)
	(path p3-1 s1)
	(path s4 p4-3)
	(path p4-3 s4)
	(path s3 p4-3)
	(path p4-3 s3)
	(link s0 s1)
	(link s1 s0)
	(= (time-to-drive s0 s1) 40)
	(= (time-to-drive s1 s0) 40)
	(link s0 s2)
	(link s2 s0)
	(= (time-to-drive s0 s2) 12)
	(= (time-to-drive s2 s0) 12)
	(link s0 s3)
	(link s3 s0)
	(= (time-to-drive s0 s3) 35)
	(= (time-to-drive s3 s0) 35)
	(link s0 s4)
	(link s4 s0)
	(= (time-to-drive s0 s4) 97)
	(= (time-to-drive s4 s0) 97)
	(link s1 s4)
	(link s4 s1)
	(= (time-to-drive s1 s4) 44)
	(= (time-to-drive s4 s1) 44)
	(link s2 s1)
	(link s1 s2)
	(= (time-to-drive s2 s1) 73)
	(= (time-to-drive s1 s2) 73)
	(link s2 s3)
	(link s3 s2)
	(= (time-to-drive s2 s3) 49)
	(= (time-to-drive s3 s2) 49)
	(link s3 s1)
	(link s1 s3)
	(= (time-to-drive s3 s1) 87)
	(= (time-to-drive s1 s3) 87)
	(link s3 s4)
	(link s4 s3)
	(= (time-to-drive s3 s4) 48)
	(= (time-to-drive s4 s3) 48)
	(link s4 s2)
	(link s2 s4)
	(= (time-to-drive s4 s2) 37)
	(= (time-to-drive s2 s4) 37)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver1 s0)
	(at driver2 s2)
	(at truck2 s1)
	(at truck4 s3)
	(at truck5 s0)
	(at truck6 s4)
	(at package1 s1)
	(at package2 s0)
	(at package3 s1)
	(at package4 s3)
	(at package5 s1)
	(at package6 s3)
	(at package7 s3)
	(at package8 s3)
	))

(:metric minimize (+ (* 4 (total-time)) (* 1 (fuel-used))))

)

; plan
1. (board-truck driver1 truck6 s2)
   deleted: (at driver1 s2) (empty truck6)
   added: (driving driver1 truck6)
   goals met: 2 of 14
2. (walk driver2 s3 p2-3)
   deleted: (at driver2 s3)
   added: (at driver2 p2-3)
   goals met: 2 of 14
3. (load-truck package6 truck6 s2)
   deleted: (at package6 s2)
   added: (in package6 truck6)
   changed: (load truck6) from 0 to 1, (fuel-per-minute truck6) from 10 to 11
   goals met: 2 of 14
4. (drive-truck truck6 s2 s4 driver1)
   deleted: (at truck6 s2)
   added: (at truck6 s4)
   changed: (fuel-used) from 0 to 407
   goals met: 3 of 14
5. (walk driver2 p2-3 s2)
   deleted: (at driver2 p2-3)
   added: (at driver2 s2)
   goals met: 4 of 14
6. (load-truck package3 truck6 s4)
   deleted: (at package3 s4)
   added: (in package3 truck6)
   changed: (load truck6) from 1 to 2, (fuel-per-minute truck6) from 11 to 13
   goals met: 4 of 14
7. (load-truck package1 truck6 s4)
   deleted: (at package1 s4)
   added: (in package1 truck6)
   changed: (load truck6) from 2 to 3, (fuel-per-minute truck6) from 13 to 16
   goals met: 4 of 14
8. (drive-truck truck6 s4 s0 driver1)
   deleted: (at truck6 s4)
   added: (at truck6 s0)
   changed: (fuel-used) from 407 to 1959
   goals met: 3 of 14
9. (load-truck package4 truck6 s0)
   deleted: (at package4 s0)
   added: (in package4 truck6)
   changed: (load truck6) from 3 to 4, (fuel-per-minute truck6) from 16 to 20
   goals met: 3 of 14
10. (drive-truck truck6 s0 s3 driver1)
   deleted: (at truck6 s0)
   added: (at truck6 s3)
   changed: (fuel-used) from 1959 to 2659
   goals met: 3 of 14
11. (unload-truck package4 truck6 s3)
   deleted: (in package4 truck6)
   added: (at package4 s3)
   changed: (load truck6) from 4 to 3, (fuel-per-minute truck6) from 20 to 16
   goals met: 4 of 14
12. (unload-truck package6 truck6 s3)
   deleted: (in package6 truck6)
   added: (at package6 s3)
   changed: (load truck6) from 3 to 2, (fuel-per-minute truck6) from 16 to 13
   goals met: 5 of 14
13. (drive-truck truck6 s3 s1 driver1)
   deleted: (at truck6 s3)
   added: (at truck6 s1)
   changed: (fuel-used) from 2659 to 3790
   goals met: 5 of 14
14. (unload-truck package1 truck6 s1)
   deleted: (in package1 truck6)
   added: (at package1 s1)
   changed: (load truck6) from 2 to 1, (fuel-per-minute truck6) from 13 to 11
   goals met: 6 of 14
15. (unload-truck package3 truck6 s1)
   deleted: (in package3 truck6)
   added: (at package3 s1)
   changed: (load truck6) from 1 to 0, (fuel-per-minute truck6) from 11 to 10
   goals met: 7 of 14
16. (load-truck package2 truck6 s1)
   deleted: (at package2 s1)
   added: (in package2 truck6)
   changed: (load truck6) from 0 to 1, (fuel-per-minute truck6) from 10 to 11
   goals met: 7 of 14
17. (load-truck package8 truck6 s1)
   deleted: (at package8 s1)
   added: (in package8 truck6)
   changed: (load truck6) from 1 to 2, (fuel-per-minute truck6) from 11 to 13
   goals met: 7 of 14
18. (drive-truck truck6 s1 s0 driver1)
   deleted: (at truck6 s1)
   added: (at truck6 s0)
   changed: (fuel-used) from 3790 to 4310
   goals met: 7 of 14
19. (unload-truck package2 truck6 s0)
   deleted: (in package2 truck6)
   added: (at package2 s0)
   changed: (load truck6) from 2 to 1, (fuel-per-minute truck6) from 13 to 11
   goals met: 8 of 14
20. (load-truck package7 truck6 s0)
   deleted: (at package7 s0)
   added: (in package7 truck6)
   changed: (load truck6) from 1 to 2, (fuel-per-minute truck6) from 11 to 13
   goals met: 8 of 14
21. (drive-truck truck6 s0 s3 driver1)
   deleted: (at truck6 s0)
   added: (at truck6 s3)
   changed: (fuel-used) from 4310 to 4765
   goals met: 8 of 14
22. (unload-truck package8 truck6 s3)
   deleted: (in package8 truck6)
   added: (at package8 s3)
   changed: (load truck6) from 2 to 1, (fuel-per-minute truck6) from 13 to 11
   goals met: 9 of 14
23. (walk driver2 s2 p2-4)
   deleted: (at driver2 s2)
   added: (at driver2 p2-4)
   goals met: 8 of 14
24. (walk driver2 p2-4 s4)
   deleted: (at driver2 p2-4)
   added: (at driver2 s4)
   goals met: 8 of 14
25. (board-truck driver2 truck5 s4)
   deleted: (at driver2 s4) (empty truck5)
   added: (driving driver2 truck5)
   goals met: 8 of 14
26. (drive-truck truck6 s3 s4 driver1)
   deleted: (at truck6 s3)
   added: (at truck6 s4)
   changed: (fuel-used) from 4765 to 5293
   goals met: 9 of 14
27. (drive-truck truck5 s4 s0 driver2)
   deleted: (at truck5 s4)
   added: (at truck5 s0)
   changed: (fuel-used) from 5293 to 6263
   goals met: 10 of 14
28. (disembark-truck driver1 truck6 s4)
   deleted: (driving driver1 truck6)
   added: (at driver1 s4) (empty truck6)
   goals met: 10 of 14
29. (unload-truck package7 truck6 s4)
   deleted: (in package7 truck6)
   added: (at package7 s4)
   changed: (load truck6) from 1 to 0, (fuel-per-minute truck6) from 11 to 10
   goals met: 10 of 14
30. (load-truck package7 truck4 s4)
   deleted: (at package7 s4)
   added: (in package7 truck4)
   changed: (load truck4) from 0 to 1, (fuel-per-minute truck4) from 10 to 11
   goals met: 10 of 14
31. (board-truck driver1 truck3 s4)
   deleted: (at driver1 s4) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 10 of 14
32. (drive-truck truck3 s4 s0 driver1)
   deleted: (at truck3 s4)
   added: (at truck3 s0)
   changed: (fuel-used) from 6263 to 7233
   goals met: 10 of 14
33. (disembark-truck driver1 truck3 s0)
   deleted: (driving driver1 truck3)
   added: (at driver1 s0) (empty truck3)
   goals met: 11 of 14
34. (unload-truck package7 truck4 s4)
   deleted: (in package7 truck4)
   added: (at package7 s4)
   changed: (load truck4) from 1 to 0, (fuel-per-minute truck4) from 11 to 10
   goals met: 11 of 14
35. (drive-truck truck5 s0 s4 driver2)
   deleted: (at truck5 s0)
   added: (at truck5 s4)
   changed: (fuel-used) from 7233 to 8203
   goals met: 10 of 14
36. (disembark-truck driver2 truck5 s4)
   deleted: (driving driver2 truck5)
   added: (at driver2 s4) (empty truck5)
   goals met: 10 of 14
37. (walk driver2 s4 p2-4)
   deleted: (at driver2 s4)
   added: (at driver2 p2-4)
   goals met: 10 of 14
38. (walk driver2 p2-4 s2)
   deleted: (at driver2 p2-4)
   added: (at driver2 s2)
   goals met: 11 of 14
39. (board-truck driver3 truck2 s1)
   deleted: (at driver3 s1) (empty truck2)
   added: (driving driver3 truck2)
   goals met: 11 of 14
40. (drive-truck truck2 s1 s4 driver3)
   deleted: (at truck2 s1)
   added: (at truck2 s4)
   changed: (fuel-used) from 8203 to 8643
   goals met: 10 of 14
41. (load-truck package7 truck2 s4)
   deleted: (at package7 s4)
   added: (in package7 truck2)
   changed: (load truck2) from 0 to 1, (fuel-per-minute truck2) from 10 to 11
   goals met: 10 of 14
42. (drive-truck truck2 s4 s3 driver3)
   deleted: (at truck2 s4)
   added: (at truck2 s3)
   changed: (fuel-used) from 8643 to 9171
   goals met: 10 of 14
43. (unload-truck package7 truck2 s3)
   deleted: (in package7 truck2)
   added: (at package7 s3)
   changed: (load truck2) from 1 to 0, (fuel-per-minute truck2) from 11 to 10
   goals met: 11 of 14
44. (walk driver2 s2 p2-4)
   deleted: (at driver2 s2)
   added: (at driver2 p2-4)
   goals met: 10 of 14
45. (drive-truck truck2 s3 s1 driver3)
   deleted: (at truck2 s3)
   added: (at truck2 s1)
   changed: (fuel-used) from 9171 to 10041
   goals met: 11 of 14
46. (walk driver2 p2-4 s4)
   deleted: (at driver2 p2-4)
   added: (at driver2 s4)
   goals met: 11 of 14
47. (board-truck driver2 truck5 s4)
   deleted: (at driver2 s4) (empty truck5)
   added: (driving driver2 truck5)
   goals met: 11 of 14
48. (drive-truck truck5 s4 s2 driver2)
   deleted: (at truck5 s4)
   added: (at truck5 s2)
   changed: (fuel-used) from 10041 to 10411
   goals met: 11 of 14
49. (disembark-truck driver2 truck5 s2)
   deleted: (driving driver2 truck5)
   added: (at driver2 s2) (empty truck5)
   goals met: 12 of 14
50. (walk driver2 s2 p2-4)
   deleted: (at driver2 s2)
   added: (at driver2 p2-4)
   goals met: 11 of 14
51. (walk driver2 p2-4 s4)
   deleted: (at driver2 p2-4)
   added: (at driver2 s4)
   goals met: 11 of 14
52. (walk driver1 s0 p0-2)
   deleted: (at driver1 s0)
   added: (at driver1 p0-2)
   goals met: 10 of 14
53. (walk driver1 p0-2 s2)
   deleted: (at driver1 p0-2)
   added: (at driver1 s2)
   goals met: 10 of 14
54. (board-truck driver1 truck5 s2)
   deleted: (at driver1 s2) (empty truck5)
   added: (driving driver1 truck5)
   goals met: 10 of 14
55. (drive-truck truck5 s2 s0 driver1)
   deleted: (at truck5 s2)
   added: (at truck5 s0)
   changed: (fuel-used) from 10411 to 10531
   goals met: 11 of 14
56. (walk driver2 s4 p2-4)
   deleted: (at driver2 s4)
   added: (at driver2 p2-4)
   goals met: 11 of 14
57. (walk driver2 p2-4 s2)
   deleted: (at driver2 p2-4)
   added: (at driver2 s2)
   goals met: 12 of 14
58. (drive-truck truck5 s0 s4 driver1)
   deleted: (at truck5 s0)
   added: (at truck5 s4)
   changed: (fuel-used) from 10531 to 11501
   goals met: 11 of 14
59. (disembark-truck driver1 truck5 s4)
   deleted: (driving driver1 truck5)
   added: (at driver1 s4) (empty truck5)
   goals met: 11 of 14
60. (board-truck driver1 truck6 s4)
   deleted: (at driver1 s4) (empty truck6)
   added: (driving driver1 truck6)
   goals met: 11 of 14
61. (drive-truck truck6 s4 s0 driver1)
   deleted: (at truck6 s4)
   added: (at truck6 s0)
   changed: (fuel-used) from 11501 to 12471
   goals met: 10 of 14
62. (walk driver2 s2 p2-4)
   deleted: (at driver2 s2)
   added: (at driver2 p2-4)
   goals met: 9 of 14
63. (walk driver2 p2-4 s4)
   deleted: (at driver2 p2-4)
   added: (at driver2 s4)
   goals met: 9 of 14
64. (board-truck driver2 truck4 s4)
   deleted: (at driver2 s4) (empty truck4)
   added: (driving driver2 truck4)
   goals met: 9 of 14
65. (drive-truck truck4 s4 s3 driver2)
   deleted: (at truck4 s4)
   added: (at truck4 s3)
   changed: (fuel-used) from 12471 to 12951
   goals met: 10 of 14
66. (drive-truck truck2 s1 s4 driver3)
   deleted: (at truck2 s1)
   added: (at truck2 s4)
   changed: (fuel-used) from 12951 to 13391
   goals met: 9 of 14
67. (disembark-truck driver3 truck2 s4)
   deleted: (driving driver3 truck2)
   added: (at driver3 s4) (empty truck2)
   goals met: 9 of 14
68. (board-truck driver3 truck5 s4)
   deleted: (at driver3 s4) (empty truck5)
   added: (driving driver3 truck5)
   goals met: 9 of 14
69. (drive-truck truck5 s4 s0 driver3)
   deleted: (at truck5 s4)
   added: (at truck5 s0)
   changed: (fuel-used) from 13391 to 14361
   goals met: 10 of 14
70. (drive-truck truck4 s3 s2 driver2)
   deleted: (at truck4 s3)
   added: (at truck4 s2)
   changed: (fuel-used) from 14361 to 14851
   goals met: 9 of 14
71. (drive-truck truck4 s2 s4 driver2)
   deleted: (at truck4 s2)
   added: (at truck4 s4)
   changed: (fuel-used) from 14851 to 15221
   goals met: 9 of 14
72. (drive-truck truck6 s0 s4 driver1)
   deleted: (at truck6 s0)
   added: (at truck6 s4)
   changed: (fuel-used) from 15221 to 16191
   goals met: 10 of 14
73. (disembark-truck driver2 truck4 s4)
   deleted: (driving driver2 truck4)
   added: (at driver2 s4) (empty truck4)
   goals met: 10 of 14
74. (board-truck driver2 truck2 s4)
   deleted: (at driver2 s4) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 10 of 14
75. (disembark-truck driver1 truck6 s4)
   deleted: (driving driver1 truck6)
   added: (at driver1 s4) (empty truck6)
   goals met: 10 of 14
76. (drive-truck truck2 s4 s0 driver2)
   deleted: (at truck2 s4)
   added: (at truck2 s0)
   changed: (fuel-used) from 16191 to 17161
   goals met: 10 of 14
77. (disembark-truck driver3 truck5 s0)
   deleted: (driving driver3 truck5)
   added: (at driver3 s0) (empty truck5)
   goals met: 10 of 14
78. (drive-truck truck2 s0 s1 driver2)
   deleted: (at truck2 s0)
   added: (at truck2 s1)
   changed: (fuel-used) from 17161 to 17561
   goals met: 11 of 14
79. (disembark-truck driver2 truck2 s1)
   deleted: (driving driver2 truck2)
   added: (at driver2 s1) (empty truck2)
   goals met: 11 of 14
80. (board-truck driver1 truck4 s4)
   deleted: (at driver1 s4) (empty truck4)
   added: (driving driver1 truck4)
   goals met: 11 of 14
81. (drive-truck truck4 s4 s3 driver1)
   deleted: (at truck4 s4)
   added: (at truck4 s3)
   changed: (fuel-used) from 17561 to 18041
   goals met: 12 of 14
82. (disembark-truck driver1 truck4 s3)
   deleted: (driving driver1 truck4)
   added: (at driver1 s3) (empty truck4)
   goals met: 12 of 14
83. (walk driver1 s3 p0-3)
   deleted: (at driver1 s3)
   added: (at driver1 p0-3)
   goals met: 12 of 14
84. (board-truck driver4 truck2 s1)
   deleted: (at driver4 s1) (empty truck2)
   added: (driving driver4 truck2)
   goals met: 12 of 14
85. (walk driver1 p0-3 s0)
   deleted: (at driver1 p0-3)
   added: (at driver1 s0)
   goals met: 13 of 14
86. (drive-truck truck2 s1 s2 driver4)
   deleted: (at truck2 s1)
   added: (at truck2 s2)
   changed: (fuel-used) from 18041 to 18771
   goals met: 12 of 14
87. (disembark-truck driver4 truck2 s2)
   deleted: (driving driver4 truck2)
   added: (at driver4 s2) (empty truck2)
   goals met: 12 of 14
88. (walk driver2 s1 p3-1)
   deleted: (at driver2 s1)
   added: (at driver2 p3-1)
   goals met: 12 of 14
89. (board-truck driver4 truck2 s2)
   deleted: (at driver4 s2) (empty truck2)
   added: (driving driver4 truck2)
   goals met: 12 of 14
90. (drive-truck truck2 s2 s1 driver4)
   deleted: (at truck2 s2)
   added: (at truck2 s1)
   changed: (fuel-used) from 18771 to 19501
   goals met: 13 of 14
91. (walk driver2 p3-1 s3)
   deleted: (at driver2 p3-1)
   added: (at driver2 s3)
   goals met: 13 of 14
92. (walk driver2 s3 p2-3)
   deleted: (at driver2 s3)
   added: (at driver2 p2-3)
   goals met: 13 of 14
93. (walk driver2 p2-3 s2)
   deleted: (at driver2 p2-3)
   added: (at driver2 s2)
   goals met: 14 of 14
